<template>
  <div class="wrapper" ref="wrapper">
    <scroll class="wrapper">
      <div>
        <p>
          文学是一种语言艺术，是话语蕴藉中的审美意识形态。诗歌、散文、小说、剧本、寓言、
          童话等不同体裁，是文学的重要表现形式。文学以不同的形式即体裁，表现内心情感，
          再现一定时期和一定地域的社会生活。作为学科门类理解的文学，包括中国语言文学、
          外国语言文学及新闻传播学。
        </p>
        <p>
          文学是属于人文学科的学科分类之一，与哲学、宗教、法律、政治并驾于社会建筑上层。
          它起源于人类的思维活动。最先出现的是口头文学，一般是与音乐联结为可以演唱的抒情诗歌。
          最早形成书面文学的有中国的《诗经》、印度的《罗摩衍那》和古希腊的《伊利昂纪》等。
          中国先秦时期将以文字写成的作品都统称为文学，魏晋以后才逐渐将文学作品单独列出。
          欧洲传统文学理论分类法将文学分为诗、散文、戏剧三大类。
          现代通常将文学分为诗歌、小说、散文、戏剧四大类别。
        </p>
        <p>
          文学是属于人文学科的学科分类之一，与哲学、宗教、法律、政治并驾于社会建筑上层。
          它起源于人类的思维活动。最先出现的是口头文学，一般是与音乐联结为可以演唱的抒情诗歌。
          最早形成书面文学的有中国的《诗经》、印度的《罗摩衍那》和古希腊的《伊利昂纪》等。
          中国先秦时期将以文字写成的作品都统称为文学，魏晋以后才逐渐将文学作品单独列出。
          欧洲传统文学理论分类法将文学分为诗、散文、戏剧三大类。
          现代通常将文学分为诗歌、小说、散文、戏剧四大类别。
        </p>
        <p>
          文学是属于人文学科的学科分类之一，与哲学、宗教、法律、政治并驾于社会建筑上层。
          它起源于人类的思维活动。最先出现的是口头文学，一般是与音乐联结为可以演唱的抒情诗歌。
          最早形成书面文学的有中国的《诗经》、印度的《罗摩衍那》和古希腊的《伊利昂纪》等。
          中国先秦时期将以文字写成的作品都统称为文学，魏晋以后才逐渐将文学作品单独列出。
          欧洲传统文学理论分类法将文学分为诗、散文、戏剧三大类。
          现代通常将文学分为诗歌、小说、散文、戏剧四大类别。
        </p>
      </div>
    </scroll>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
.wrapper {
  height: 600px;
  padding: 10px;
  p {
    font-size: 14px;
    text-indent: 14px;
  }
}
</style>
